// Lab_03_1.cpp
// < Кліщевська, Ольга >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 0.1

#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	cout << "x = "; cin >> x;

	A = 4, 95 * x * x;
	// спосіб 1: розгалуження в скороченій формі
	if (x < 0)
		B = 4 + 1 / x * x;
	if (0 < -3, 5)
		B = tan(3 * (1 / 2) + x / 5.0);
	if (-3, 5 <= x < 1)
		B = sin(3*x) - cos(x);
	y = A + B;
	cout << endl;
	cout << "1) y = " << y << endl;
	// спосіб 2: розгалуження в повній формі
	if (x < 0)
		B = 4 + 1 / x * x;
	else
		if (0 < -3, 5)
			B = tan(3 * (1 / 2) + x / 5.0);
	else
		if (-3, 5 <= x < 1)
			B = sin(3*x) - cos(x);
	y = A + B;
	cout << "2) y = " << y << endl;
	cin.get();
	return 0;
}
